DataProcessors/НастройкиGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>НастройкиGoogle</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВариантыНастроекГуглСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВариантыНастроекГуглСервисов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ClientID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ClientSecret</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>code</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>access_token</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>refresh_token</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаПолученияТокена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>expires_in</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/НастройкиGoogle/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьТокен(Команда)
	ИнтеграцияСГуглСервисамиСЗ.POSTЗапрос_ПолучениеТокена();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРазрешения(Команда)
	
	Если Не ЗначениеЗаполнено(ClientID) Или Не ЗначениеЗаполнено(ClientSecret) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнены обязательные реквизиты");
		Возврат
	КонецЕсли;
	
	ОткрытьФорму("Обработка.НастройкиGoogle.Форма.ФормаАвторизации");
	
КонецПроцедуры

&НаСервере
Процедура ClientIDПриИзмененииНаСервере()
	РегистрыСведений.НастройкиПодключенияГуглСервисов.ЗаписатьЗначениеНастройки(Перечисления.ВариантыНастроекГуглСервисов.ClientID, ClientID);	
КонецПроцедуры

&НаКлиенте
Процедура ClientIDПриИзменении(Элемент)
	ClientIDПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ClientSecretПриИзмененииНаСервере()
	РегистрыСведений.НастройкиПодключенияГуглСервисов.ЗаписатьЗначениеНастройки(Перечисления.ВариантыНастроекГуглСервисов.ClientSecret, ClientSecret);
КонецПроцедуры

&НаКлиенте
Процедура ClientSecretПриИзменении(Элемент)
	ClientSecretПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокНастроек = РегистрыСведений.НастройкиПодключенияГуглСервисов.ПолучитьСписокНастроек();
	
	ClientID = СписокНастроек.Получить(Перечисления.ВариантыНастроекГуглСервисов.ClientID);
	
	ClientSecret = СписокНастроек.Получить(Перечисления.ВариантыНастроекГуглСервисов.ClientSecret);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТокенНаСервере()
	ИнтеграцияСГуглСервисамиСЗ.POSTЗапрос_ОбновитьТокен();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТокен(Команда)
	ОбновитьТокенНаСервере();
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьЗадачиНаСервере()
	СЗ_GoogleTasks.GET_ОбновитьСписки();
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьЗадачи(Команда)
	СинхронизироватьЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗадачиНаСервере()
	СЗ_GoogleTasks.GET_ОбновитьЗадачи();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗадачи(Команда)
	ПолучитьЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКалендариНаСервере()
	
	      //  GET https://www.googleapis.com/calendar/v3/users/me/calendarList
	
	Соединение = Новый HTTPСоединение("www.googleapis.com",443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки  = Новый Соответствие;		
	Заголовки.Вставить("Authorization","Bearer " + РегистрыСведений.НастройкиПодключенияГуглСервисов.ПолучитьТокен());
	

	ЗапросHTTP = Новый HTTPЗапрос("/calendar/v3/users/me/calendarList", Заголовки);
	Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);	
	
	Если НЕ Ответ.КодСостояния = 200 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка получения параметров авторизации: %1", Ответ.ПолучитьТелоКакСтроку()));	
	КонецЕсли;
	
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		
	//https://www.googleapis.com/calendar/v3
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКалендари(Команда)
	ПолучитьКалендариНаСервере();
КонецПроцедуры
